from env import settings
charge_doc_channel_id = "none"
admin_username = "none"

help_msg = """
📋 <b>قوانین رزرو و شرایط کنسلی نوبت در ربات آرایشگاه</b>

مشتری گرامی، خواهشمندیم قبل از رزرو نوبت به موارد زیر دقت فرمایید:

<b>۱. کنسلی نوبت تا ۱ ساعت قبل از زمان رزرو:</b>
در صورتی که نوبت خود را حداقل ۱ ساعت قبل از زمان تعیین‌شده لغو نمایید، مبلغ پرداختی شما به صورت کامل و بدون کسر هزینه به حساب کاربری‌تان در ربات بازگردانده می‌شود و قابل استفاده در رزروهای بعدی خواهد بود. لطفاً جهت ثبت درخواست کنسلی، با شماره تلفن زیر تماس حاصل نموده و اطلاع‌رسانی نمایید:

📞 <b>+98 912 687 4628</b>

<b>۲. کنسلی نوبت در کمتر از ۱ ساعت مانده به زمان نوبت:</b>
در صورتی که کنسلی کمتر از ۱ ساعت مانده به زمان نوبت انجام شود، ۱۵٪ از مبلغ پرداختی به عنوان هزینه لغو کسر شده و مابقی به حساب کاربری شما در ربات بازگردانده خواهد شد تا در نوبت‌های بعدی استفاده شود. لطفاً جهت اطلاع از کنسلی در سریع‌ترین زمان ممکن، با شماره زیر تماس بگیرید:

📞 <b>+98 912 687 4628</b>

<b>۳. تهیه مواد برای خدمات رنگ و پروتئین‌تراپی مو:</b>
در خصوص خدماتی مانند رنگ مو و پروتئین‌تراپی، مشتریان گرامی موظف به تهیه و تأمین مواد مصرفی مورد نیاز هستند. آرایشگاه صرفاً خدمات اجرا را ارائه می‌دهد و مسئولیتی در قبال کیفیت یا اصالت مواد تهیه‌شده توسط مشتری ندارد.

از اعتماد و همکاری شما سپاسگزاریم 🌟  
آرزوی ما زیبایی و رضایت همیشگی شماست.
"""

welcome_msg = f"""
به ربات آرایشگاه ما خوش آمدید 🌟

از طریق منوی زیر می‌توانید:
🗓️ رزرو وقت جدید انجام دهید
📖 رزروهای خود را مشاهده کنید
💰 موجودی حساب خود را چک کنید

{help_msg}

برای شروع، از دکمه‌های زیر استفاده کنید 👇
"""